 
Функция ЖурналКабельнойЛинииПодписан(ЖурналУчетаКабельнойПродукции) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;		
	Запрос.УстановитьПараметр("ЖурналУчетаКабельнойЛинии", ЖурналУчетаКабельнойПродукции);
	Запрос.Текст = "ВЫБРАТЬ
	               |	1 КАК Поле1
	               |ИЗ
	               |	РегистрСведений.ДанныеПоЖурналамКабельнойПродукции.СрезПоследних(, ЖурналУчетаКабельнойЛинии = &ЖурналУчетаКабельнойЛинии) КАК ДанныеПоЖурналамКабельнойПродукцииСрезПоследних
	               |ГДЕ
	               |	ДанныеПоЖурналамКабельнойПродукцииСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЖруналКабелей.Подписан)";
	
	Результат = Запрос.Выполнить();	
	Возврат Не Результат.Пустой();
	
КонецФункции

Функция ЖурналКабельнойЛинииСмонтирован(ЖурналУчетаКабельнойПродукции) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;		
	Запрос.УстановитьПараметр("ЖурналУчетаКабельнойЛинии", ЖурналУчетаКабельнойПродукции);
	Запрос.Текст = "ВЫБРАТЬ
	               |	1 КАК Поле1
	               |ИЗ
	               |	РегистрСведений.ДанныеПоМонтажуКабельнойПродукции.СрезПоследних(, ЖурналУчетаКабельнойЛинии = &ЖурналУчетаКабельнойЛинии) КАК ДанныеПоМонтажуКабельнойПродукцииСрезПоследних
	               |ГДЕ
	               |	ДанныеПоМонтажуКабельнойПродукцииСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыМонтажа.Выполнен)";
	
	Результат = Запрос.Выполнить();	
	Возврат Не Результат.Пустой();
	
КонецФункции

 