
Процедура ОповеститьПользователейОПросроченныхЗаявокНаМонтаж() Экспорт 
	
	СписокПросроченныхЗаявок = ОповещениеПользователейСервер.ПрочитатьПросроченныеЗаявкиНаМонтаж();
	Если СписокПросроченныхЗаявок.Количество() > 0 Тогда 
		
		Если ОповещениеПользователейСервер.ОповеститьТекущегоПользователя() Тогда 
			
			ТекстОповещения = "";
			Для Каждого ТекЗаявка Из СписокПросроченныхЗаявок Цикл
				ТекстОповещения = ТекстОповещения + ?(ТекстОповещения <> "", Символы.ПС, "") + ТекЗаявка;	
			КонецЦикла;	
			Сигнал();
			//ПоказатьОповещениеПользователя(ТекстОповещения,,,БиблиотекаКартинок.Информация32, СтатусОповещенияПользователя.Важное);
			ПоказатьПредупреждение(,ТекстОповещения,,"Просроченные заявки на монтаж");
			
		КонецЕсли;			
	КонецЕсли;	
	
КонецПроцедуры