
Процедура ЗаписатьНаборыЗаписей(ОбъектЗаписи) Экспорт
	
		
	
КонецПроцедуры

Функция ЕстьДублиКабельныеЛинии(КабельныеЛинии) Экспорт
	
	МассивКабельныеЛинии = КабельныеЛинии.ВыгрузитьКолонку("КабельнаяЛиния");
	
	Возврат МассивКабельныеЛинии.Количество() > 1;	
	
КонецФункции

Процедура ЗаписьДанныеВРСДанныеЖКП(КабельныеЛинии, Ссылка = Неопределено, СтатусКабельнойЛинии = Неопределено, Изменить = Ложь) Экспорт  

	Если Изменить Тогда  
		Для Каждого ТекДанные Из КабельныеЛинии Цикл  
			МенеджерЗаписи = РегистрыСведений.ДанныеЖурналовУчетаКП.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ТекДанные);
			МенеджерЗаписи.ЖурналКабельнойПродукции = ?(Ссылка = Неопределено, ТекДанные.ЖурналУчетаКП, Ссылка); 
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.СтатусКабельнойЛинии = ?(СтатусКабельнойЛинии = Неопределено, ТекДанные.Статус, СтатусКабельнойЛинии);
				МенеджерЗаписи.Записать(); 
			КонецЕсли;
		КонецЦикла;			
	Иначе	
		УдалитьДанныеВРСДанныеЖКП(КабельныеЛинии, Ссылка);	
		Для Каждого ТекДанные Из КабельныеЛинии Цикл  
			МенеджерЗаписи = РегистрыСведений.ДанныеЖурналовУчетаКП.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ТекДанные);
			МенеджерЗаписи.ЖурналКабельнойПродукции = ?(Ссылка = Неопределено, ТекДанные.ЖурналУчетаКП, Ссылка);   
			МенеджерЗаписи.СтатусКабельнойЛинии     = ?(СтатусКабельнойЛинии = Неопределено, ТекДанные.Статус, СтатусКабельнойЛинии);
			МенеджерЗаписи.Записать();
		КонецЦикла;	
	КонецЕсли;

КонецПроцедуры

Процедура УдалитьДанныеВРСДанныеЖКП(КабельныеЛинии, Ссылка = Неопределено) Экспорт  
	
	Для Каждого УдаляемыйКабель Из КабельныеЛинии Цикл   
		МенеджерЗаписи = РегистрыСведений.ДанныеЖурналовУчетаКП.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.КабельнаяЛиния           = УдаляемыйКабель.КабельнаяЛиния; 
		МенеджерЗаписи.ЖурналКабельнойПродукции = ?(Ссылка = Неопределено, УдаляемыйКабель.ЖурналУчетаКП, Ссылка);
		МенеджерЗаписи.Удалить();	
	КонецЦикла;
	
КонецПроцедуры