
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ДанныеПоЗаявкамНаЗакупку.Записывать = Истина;
	
	НоваяЗапись                               = Движения.ДанныеПоЗаявкамНаЗакупку.Добавить();
	НоваяЗапись.Период                        = Дата; 
	НоваяЗапись.ЖурналУчетаКабельнойПродукции = ЖурналУчетаКабельнойПродукции;  
	НоваяЗапись.Подрядчик                     = Подрядчик;
	НоваяЗапись.Статус                        = Статус;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтоОтменаЗаявки() И СтатусыПроверкаСервер.ЖурналКабельнойЛинииСмонтирован(ЖурналУчетаКабельнойПродукции) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Монтаж выполнен, нельзя отменить документ!",,,, Отказ);	
	КонецЕсли;	
	
КонецПроцедуры 

Функция ЭтоОтменаЗаявки()
	
	ТекущийСтатусВыполнен = (Ссылка.Статус = Перечисления.СтатусыЗаявок.Выполнена);
	СменаСтатуса          = (Статус <> Ссылка.Статус);
	
	Возврат ТекущийСтатусВыполнен И СменаСтатуса;
	
КонецФункции


