#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;			
		
	УдаляемыеКабельныеЛинии = НайтиУдаляемыеКабельныеЛинии();
	
	ОчиститьЖурналКабельныхЛиний(УдаляемыеКабельныеЛинии);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;			

	УстановитьВладелецКабельнымЛиниям();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура УстановитьВладелецКабельнымЛиниям()

	Для Каждого ТекКабельнаяЛиния Из КабельныеЛинии Цикл
		ОбъектЛиния = ТекКабельнаяЛиния.КабельнаяЛиния.ПолучитьОбъект();
		ОбъектЛиния.Владелец = Ссылка;
		ОбъектЛиния.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиУдаляемыеКабельныеЛинии()

	КабельныеЛинииДоУдаления    = Ссылка.КабельныеЛинии;
	КабельныеЛинииПослеУдаления = КабельныеЛинии;
	
	МассивДоУдаления    = КабельныеЛинииДоУдаления.ВыгрузитьКолонку("КабельнаяЛиния");
	МассивПослеУдаления = КабельныеЛинииПослеУдаления.ВыгрузитьКолонку("КабельнаяЛиния");
		
	УдаляемыеКабельныеЛинии = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивДоУдаления, МассивПослеУдаления);

	Возврат УдаляемыеКабельныеЛинии;
	
КонецФункции

Процедура ОчиститьЖурналКабельныхЛиний(МассивКабельныхЛиний)

	Для Каждого ТекКабЛиния Из МассивКабельныхЛиний Цикл		
		ОбъектКабельнаяЛиния          = ТекКабЛиния.ПолучитьОбъект();		
		ОбъектКабельнаяЛиния.Владелец = Справочники.ЖурналыУчетаКабельнойПродукции.ПустаяСсылка();	
		ОбъектКабельнаяЛиния.ОбменДанными.Загрузка = Истина;	
		ОбъектКабельнаяЛиния.Записать();
	КонецЦикла;		
	
КонецПроцедуры
#КонецОбласти

