
#Область Печать
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ИКЖ";
	//КомандаПечати.Представление = "ИКЖ";
	//КомандаПечати.Обработчик = "УправлениеПечатьюКлиент.ВыполнитьКомандуПечати";
	//КомандаПечати.СписокФорм = "ФормаДокумента, ФормаСписка";

	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ИКЖ_1";
	//КомандаПечати.Представление = "ИКЖ_1";
	//КомандаПечати.Обработчик = "УправлениеПечатьюКлиент.ВыполнитьКомандуПечати";
	//КомандаПечати.СписокФорм = "ФормаДокумента, ФормаСписка";
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыПечати.ДоступнаПечатьКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "") Тогда   
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "", "",
			СформироватьПечать(МассивОбъектов), "Документ.ЖурналыУчетаКабельнойПродукции");  
			
	КонецЕсли;
		
КонецПроцедуры

Функция СформироватьПечать(МассивОбъектов)
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	Возврат ТабДокумент;
	
КонецФункции
#КонецОбласти   

Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

