
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Выборка = Справочники.Подрядчик.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокВыбораПодрядчика.Добавить(Выборка.Ссылка, Выборка.Ссылка);		
	КонецЦикла;
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьЗаданияНаЗакупку(Команда)
	
	ПараметрыОбъекта = Новый Структура;
	ПараметрыОбъекта.Вставить("Форма", ЭтотОбъект);
	ПараметрыОбъекта.Вставить("СписокВыбораПодрядчика", СписокВыбораПодрядчика);
	ПараметрыОбъекта.Вставить("ИмяОбъекта", "ЗадниеНаЗакупку");	    
	ПараметрыОбъекта.Вставить("Подрядчик", Неопределено);	    	
	ФормыДокументовОбработчикиКоманд.ВыборПодрядчикаИКабельныеЛинии(ПараметрыОбъекта);
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормыБСП 
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)    
	
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);  
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры)

	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);	
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)   
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список); 
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()   
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);   
	
КонецПроцедуры
#КонецОбласти


#Область ПрочиеПроцедурыИФункции
 
&НаСервереБезКонтекста
Функция СоздатьЗаданиеНаЗакупки(Подрядчик, МассивДанныхЗагрузкиТЧ) Экспорт
	
	НовоеЗадание                 = Документы.ЗаданияНаЗакупку.СоздатьДокумент();
	НовоеЗадание.Дата            = ТекущаяДатаСеанса();
	НовоеЗадание.СтатусДокумента = Перечисления.СтатусыЗаданийНаЗакупку.ВыданоПодрядчику; 
	НовоеЗадание.Подрядчик       = Подрядчик;
	
	Для каждого ТекКабельнаяЛиния Из МассивДанныхЗагрузкиТЧ Цикл
		НовКабельнаяЛиния                = НовоеЗадание.КабельныеЛинии.Добавить();
		НовКабельнаяЛиния.КабельнаяЛиния = ТекКабельнаяЛиния.КабельнаяЛиния;     
		НовКабельнаяЛиния.ЖурналУчетаКП  = ТекКабельнаяЛиния.ЖурналУчетаКП;     		
		НовКабельнаяЛиния.Принято        = Истина;
	КонецЦикла;
	
	НовоеЗадание.Записать();
	
	Возврат НовоеЗадание.Ссылка; 
	
КонецФункции

#КонецОбласти
