
Процедура ПередЗаписью(Отказ)
	
	СтрокаДляПроверки = ОбщегоНазначенияПереопределяемый.СтрокаБезЦифр(Наименование);  
	СтрокаДляПроверки = ОбщегоНазначенияПереопределяемый.СтрокаБезСимволов(СтрокаДляПроверки);
	
	Если ЗначениеЗаполнено(СтрокаДляПроверки) И Не СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(СтрокаДляПроверки) Тогда  
		ТекстОшибки = "В поле ""Наименование"" необходимо вводить только литиницу!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);   
		ЗаписьЖурналаРегистрации("Создать кабельную линию", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки); 
		Отказ = Истина;	
	КонецЕсли;
	
	Отказ = ОбщегоНазначенияПереопределяемый.ПроверитьОбъектУникален(Ссылка, Наименование, "МаркиКабелиПроектные", Отказ); 	
	
КонецПроцедуры
