											 
Функция ПолучитьСтатусКабельнойЛинии(ТекущийСтатусОбъекта, ПометкаУдаления, СканДокументаПрикреплен = Ложь) Экспорт
	
	Если ПометкаУдаления Тогда  
		Статус = ПолучитьСтатусКабельнойЛинииПриПометкеНаУдаление(ТекущийСтатусОбъекта, СканДокументаПрикреплен);	  
	Иначе
		Статус = ПолучитьСтатусКабельнойЛинииПриЗаписи(ТекущийСтатусОбъекта, СканДокументаПрикреплен);	
	КонецЕсли;	
	
	Возврат Статус;
	
КонецФункции	
											 
Функция ПолучитьСтатусКабельнойЛинииПриЗаписи(ТекущийСтатусОбъекта, СканДокументаПрикреплен = Ложь)  

	СтатусКабельнойЛинии = Неопределено;
	Если ТекущийСтатусОбъекта = Перечисления.СтатусыЗаданийНаЗакупку.ВыданоПодрядчику Тогда   
		
		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ЗаданиеНаЗакупкуКППВОформлении;	     
	ИначеЕсли ТекущийСтатусОбъекта = Перечисления.СтатусыЗаданийНаЗакупку.Принято Тогда    
		
		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ВЗакупке;	 
	ИначеЕсли ТекущийСтатусОбъекта = Перечисления.СтатусыЗаявкиНаЗакупку.Поставлено Тогда    
		
		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ВходнойКонтрольНеПройден;	  
		Если СканДокументаПрикреплен Тогда
			СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ЭМРКППНеРазрешён;	  			
		КонецЕсли;
	ИначеЕсли ТекущийСтатусОбъекта = Перечисления.СтатусаМонтажаКППНаОбъекте.ЗапросНаРасмотрении Тогда

		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ЗаданиеНаЭМРКППВОформлении;		
	ИначеЕсли ТекущийСтатусОбъекта = Перечисления.СтатусаМонтажаКППНаОбъекте.МонтажКППРазрешен Тогда
		
		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ЭМРКПП;
	ИначеЕсли ТекущийСтатусОбъекта = Перечисления.СтатусаМонтажаКППНаОбъекте.МонтажКППНеРазрешен Тогда
		
		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ЭМРКППНеРазрешён;	  							
	КонецЕсли;	
	
	Возврат СтатусКабельнойЛинии;
	
КонецФункции

Функция ПолучитьСтатусКабельнойЛинииПриПометкеНаУдаление(ТекущийСтатусОбъекта, СканДокументаПрикреплен = Ложь)  

	СтатусКабельнойЛинии = Неопределено;
	Если ТекущийСтатусОбъекта = Перечисления.СтатусыЗаявкиНаЗакупку.Поставлено Тогда 
		
		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ВЗакупке;  
	ИначеЕсли ТипЗнч(ТекущийСтатусОбъекта) = Тип("ПеречислениеСсылка.СтатусыЗаданийНаЗакупку") Тогда
		
		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ЗаданиеНаЗакупкуНеВыдано;  
	ИначеЕсли ТипЗнч(ТекущийСтатусОбъекта) = Тип("ПеречислениеСсылка.СтатусаМонтажаКППНаОбъекте") Тогда

		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ЭМРКППНеРазрешён;  		
	КонецЕсли;	
	
	Возврат СтатусКабельнойЛинии;
	
КонецФункции