
Функция ПолучитьПодписи(Ссылка) Экспорт
	
	НаборКартинок = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФизическиеЛица.Подпись КАК Подпись
	               |ИЗ
	               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |ГДЕ
	               |	ФизическиеЛица.Ссылка = &Ссылка";
				   
	Запрос.УстановитьПараметр("Ссылка", Ссылка);			   
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Выборка.Следующий();
		
		Картинка = КартинкаИзФайла(Выборка.Подпись);       
		
		НаборКартинок.Вставить("ПодписьПодрядчика", Картинка);			
	Иначе
		
		НаборКартинок.Вставить("ПодписьПодрядчика", Новый Картинка);	
	КонецЕсли;
	
	Возврат НаборКартинок;
	
КонецФункции

Функция КартинкаИзФайла(СсылкаНаФайл)
	
	ДвоичныеДанные = Неопределено;
	
	Если ЗначениеЗаполнено(СсылкаНаФайл) Тогда
		ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(СсылкаНаФайл, Ложь);	
	КонецЕсли;
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат Новый Картинка;	
	КонецЕсли;
	
	Возврат Новый Картинка(ДвоичныеДанные, Истина);
	
КонецФункции
