
#Область ОбработчикиСобытийФормы
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
    ТекстСтраницы    = ПолучитьОбщийМакет("МакетHTML").ПолучитьТекст();	
	ДнныеHTMДокумент = ТекстСтраницы;
	
КонецПроцедуры
 
#КонецОбласти
 
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДнныеHTMДокументПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)

	Если ДанныеСобытия.Button.id = "ЖКП" Тогда
		
		ОткрытьФорму("Обработка.РабочееМесто.Форма.Форма");
	ИначеЕсли ДанныеСобытия.Button.id = "ЗаданияНаЗакупки" Тогда	 
		
		ОткрытьФорму("Документ.ЗаданияНаЗакупку.ФормаСписка");				
	ИначеЕсли ДанныеСобытия.Button.id = "ЗаявкиНаЗакупки" Тогда
		
		ОткрытьФорму("Документ.ЗаявкиНаЗакупки.ФормаСписка");								
	ИначеЕсли ДанныеСобытия.Button.id = "РазрешениеНаМонтаж" Тогда
		
	ИначеЕсли ДанныеСобытия.Button.id = "ЗаявкиНаПриемкиРабот" Тогда	 
		
		ОткрытьФорму("Документ.ЗаявкиНаПредъявлениеВыполненныхЭМР.ФормаСписка");																
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинку(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбора", ЭтотОбъект);
	
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(Результат, Доп) Экспорт 
	
	ПутьККартинке = Результат[0];	
	
	ДД = Новый ДвоичныеДанные(ПутьККартинке);
	
   ОбработкаВыбораНаСервере(ДД);
	
КонецПроцедуры	


&НаСервере
Процедура ОбработкаВыбораНаСервере(ДД) 
	
	ХранилищеКартинки = Новый ХранилищеЗначения(ДД);

	Константы.КартинкаВебИнтерфейса.Установить(ХранилищеКартинки);
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаЖурналУчетаНажатие(Элемент, СтандартнаяОбработка)
	
	Сообщить("Привет всем");
	
КонецПроцедуры

#КонецОбласти