
#Область Печать
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати                                = КомандыПечати.Добавить();  
	КомандаПечати.МенеджерПечати                 = "Документ.ЗаданияНаЗакупку";
	КомандаПечати.Идентификатор                  = "ЗаданияНаЗакупки_01"; 
	КомандаПечати.МестоРазмещения                = "ПодменюПечать";
	КомандаПечати.Представление                  = Нстр("ru='Задания на закупки'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ЗаданияНаЗакупки_01");
	
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = СформироватьПечать(МассивОбъектов);
		ПечатнаяФорма.СинонимМакета     = Нстр("ru='Задания на закупки'"); 
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ЗаданияНаЗакупку.ПФ_MXL_ЗаданияНаЗакупки_01";
	КонецЕсли;
		
КонецПроцедуры

Функция СформироватьПечать(МассивОбъектов)
	
	ТабДокумент = Новый ТабличныйДокумент;	
	ТабДокумент.КлючПараметровПечати = "ПараметрыПечати_ЗаданияНаЗакупки_01";  
	ТабДокумент.АвтоМасштаб          = Истина;    
	ТабДокумент.ОриентацияСтраницы   = ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаданияНаЗакупку.ПФ_MXL_ЗаданияНаЗакупки_01");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);	
	Запрос.Текст = "";
		
	Возврат ТабДокумент;
	
КонецФункции
#КонецОбласти

Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;	
	Результат.Добавить("СтатусДокумента;ФормаЗаписать,ФормаУстановитьПометкуУдаления, ФормаАннулировать, ФормаСкан");
	Результат.Добавить("Комментарий");
	Результат.Добавить("Подрядчик");
	Результат.Добавить("КабельныеЛинии");
	Возврат Результат;
	
КонецФункции