
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ОбработчикЗавершения = Новый ОписаниеОповещения("ОбработкаВыбораФайла", ЭтотОбъект, ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор);

	ПараметрыДиалога           = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберите загружаемый файл!";
	ПараметрыДиалога.Фильтр    = "Excel документ|*.xlsx;*.xls";
	НачатьПомещениеФайлаНаСервер(ОбработчикЗавершения, , , , ПараметрыДиалога, ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор);		

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайла(РезультатВыбора, УникальныйИдентификаторФормы) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	АдресВременногоХранилищаФайла = РезультатВыбора.Адрес;	
	РасширениеФайла               = СтрЗаменить(РезультатВыбора.СсылкаНаФайл.Расширение, ".", "");
	
	ОткрытьИнтерфейсЗагрузкиФайлаЭксель(АдресВременногоХранилищаФайла, РасширениеФайла, УникальныйИдентификаторФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнтерфейсЗагрузкиФайлаЭксель(АдреВременногоХранилищаФайла, РасширениеФайла, УникальныйИдентификатор)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("АдресДвоичныхДанных", АдреВременногоХранилищаФайла);
	ПараметрыФормы.Вставить("РасширениеФайла",     РасширениеФайла);	
	ОткрытьФорму("Обработка.ЗагрузкаЖурналУчетаКабельнойПродукции.Форма", ПараметрыФормы, 
				 ЭтотОбъект, УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры