#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;			
		
	//УдаляемыеКабельныеЛинии = НайтиУдаляемыеКабельныеЛинии();
	
	//ОчиститьЖурналКабельныхЛиний(УдаляемыеКабельныеЛинии);
	
	ЭтоНовыйЖурнал = Ссылка.Пустая();
	Если ЭтоНовыйЖурнал Тогда
		Наименование = Проект.Наименование;	
		ДополнительныеСвойства.Вставить("ЭтоНовый");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;			
	
	Если ПометкаУдаления Тогда      
		
		ПроведениеСервер.УдалитьДанныеВРСДанныеЖКП(КабельныеЛинии, Ссылка);
	ИначеЕсли ДополнительныеСвойства.Свойство("ЭтоНовый") Тогда      
		
		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ЗаданиеНаЗакупкуНеВыдано;
		ПроведениеСервер.ЗаписьДанныеВРСДанныеЖКП(КабельныеЛинии, Ссылка, СтатусКабельнойЛинии);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура УстановитьВладелецКабельнымЛиниям()

	Для Каждого ТекКабельнаяЛиния Из КабельныеЛинии Цикл
		ОбъектЛиния = ТекКабельнаяЛиния.КабельнаяЛиния.ПолучитьОбъект();
		ОбъектЛиния.Владелец = Ссылка;
		ОбъектЛиния.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиУдаляемыеКабельныеЛинии()

	КабельныеЛинииДоУдаления    = Ссылка.КабельныеЛинии;
	КабельныеЛинииПослеУдаления = КабельныеЛинии;
	
	МассивДоУдаления    = КабельныеЛинииДоУдаления.ВыгрузитьКолонку("КабельнаяЛиния");
	МассивПослеУдаления = КабельныеЛинииПослеУдаления.ВыгрузитьКолонку("КабельнаяЛиния");
		
	УдаляемыеКабельныеЛинии = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивДоУдаления, МассивПослеУдаления);

	Возврат УдаляемыеКабельныеЛинии;
	
КонецФункции

Процедура ОчиститьЖурналКабельныхЛиний(МассивКабельныхЛиний)

	Для Каждого ТекКабЛиния Из МассивКабельныхЛиний Цикл		
		ОбъектКабельнаяЛиния          = ТекКабЛиния.ПолучитьОбъект();		
		ОбъектКабельнаяЛиния.Владелец = Справочники.ЖурналыУчетаКабельнойПродукции.ПустаяСсылка();	
		ОбъектКабельнаяЛиния.ОбменДанными.Загрузка = Истина;	
		ОбъектКабельнаяЛиния.Записать();
	КонецЦикла;		
	
КонецПроцедуры

Процедура ЗаписьДанныеВРСДанныеЖКП()  
	
	УдалитьДанныеВРСДанныеЖКП();
	
	Для Каждого ТекДанные Из КабельныеЛинии Цикл  
		МенеджерЗаписи = РегистрыСведений.ДанныеЖурналовУчетаКП.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ТекДанные);
		МенеджерЗаписи.ЖурналКабельнойПродукции = Ссылка;   
		Если ДополнительныеСвойства.Свойство("СтатусКабельнойЛинии") Тогда   
			МенеджерЗаписи.СтатусКабельнойЛинии = ДополнительныеСвойства.СтатусКабельнойЛинии;
		КонецЕсли;	
		МенеджерЗаписи.Записать();
	КонецЦикла;	
	
КонецПроцедуры	

Процедура УдалитьДанныеВРСДанныеЖКП()  
	
	Для Каждого УдаляемыйКабель Из КабельныеЛинии Цикл   
		МенеджерЗаписи = РегистрыСведений.ДанныеЖурналовУчетаКП.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.КабельнаяЛиния           = УдаляемыйКабель.КабельнаяЛиния; 
		МенеджерЗаписи.ЖурналКабельнойПродукции = Ссылка;
		МенеджерЗаписи.Удалить();	
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти

