
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;                    
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СозданиеЗаданийНаОснованииЖурналКабели" Тогда  
		ОчиститьСообщения();
		ПоказатьНовыеЗаданияПоЖурналамКабельныхЛиний(Параметр);	
		ОбновитьИнтерфейс();
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНовыеЗаданияПоЖурналамКабельныхЛиний(Параметр)

	Если Параметр.Свойство("СписокНовыхЗаданий") И ТипЗнч(Параметр.СписокНовыхЗаданий) = Тип("Массив") Тогда			
		Для каждого ТекЗадание Из Параметр.СписокНовыхЗаданий Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекЗадание);	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиКомандФормы 
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура УстановитьУсловноеОформление()

	//СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "Список.Дата", Элементы.СписокДата.Имя);

КонецПроцедуры
#КонецОбласти